import React from "react";

export default {
  bmi: {
    underWeight: {
      title: "ผอม",
      detail: (
        <React.Fragment>
          น้ำหนักน้อยกว่าปกติ ควรกินอาหาร
          <br />
          ให้เพียงพอ เพิ่มอาหารประเภทที่ให้พลังงาน
          <br />
          มากขึ้น ควบคู่กับการออกกำลังกาย
          <br />
          เพื่อเสริมสร้างกล้ามเนื้อ
        </React.Fragment>
      ),
    },
    normal: {
      title: "สมส่วน",
      detail: (
        <React.Fragment>
          น้ำหนักปกติ ห่างไกลโรคที่เกิดจากความอ้วน
          <br />
          มีความเสี่ยงต่อการเกิดโรคต่าง ๆ น้อยที่สุด
          <br />
          พยายามรักษาค่า BMI ให้อยู่ในระดับนี้นาน ๆ
          <br />
          และควรตรวจสุขภาพทุกปี
        </React.Fragment>
      ),
    },
    overWeight: {
      title: "ท้วม",
      detail: (
        <React.Fragment>
          น้ำหนักเกิน ควรควบคุมอาหาร โดยลดปริมาณ
          <br />
          อาหารจากอาหารที่ให้พลังงานมากเป็นอาหาร
          <br />
          ที่ให้พลังงานน้อย พยายามลดน้ำหนัก
          <br />
          ให้ค่า BMI อยู่ในระดับปกติ
        </React.Fragment>
      ),
    },
    obase: {
      title: "อ้วน",
      detail: (
        <React.Fragment>
          อ้วนในระดับหนึ่ง มีความเสี่ยงต่อการเกิดโรค
          <br />
          ที่มากับความอ้วน ทั้งโรคเบาหวานและความดัน
          <br />
          โลหิตสูงควรปรับพฤติกรรมการทานอาหาร
          <br />
          ออกกำลังกาย และตรวจสุขภาพ
        </React.Fragment>
      ),
    },
    extremeObase: {
      title: "อ้วนมาก",
      detail: (
        <React.Fragment>
          ค่อนข้างอันตราย เสี่ยงต่อการเกิดโรคร้ายแรง
          <br />
          ที่แฝงมากับความอ้วน ต้องปรับพฤติกรรม
          <br />
          การทานอาหารและเริ่มออกกำลังกาย ควรไป
          <br />
          ตรวจสุขภาพและปรึกษาแพทย์อย่างสม่ำเสมอ
        </React.Fragment>
      ),
    },
  },
  temperature: {
    low: {
      title: "ต่ำกว่าปกติ",
      detail: (
        <React.Fragment>
          อุณหภูมิร่างกายต่ำกว่าปกติ อาจมีภาวะตัวเย็น
          <br />
          ควรไปพบแพทย์โดยทันที
        </React.Fragment>
      ),
    },
    normal: {
      title: "ปกติ",
      detail: (
        <React.Fragment>
          อุณหภูมิร่างกายอยู่ในเกณฑ์ปกติ ไม่มีไข้
          <br />
          พยายามรักษาสุขภาพให้แข็งแรงอยู่เสมอ
        </React.Fragment>
      ),
    },
    high: {
      title: "สูงกว่าปกติ",
      detail: (
        <React.Fragment>
          อุณหภูมิร่างกายสูงกว่าปกติ อาจมีอาการไข้
          <br />
          ควรพักผ่อนให้เพียงพอ กินอาหารที่มีประโยชน์
          <br />
          และกินยาลดไข้ หากอาการยังไม่ดีขึ้น
          <br />
          ควรปรึกษาแพทย์เพื่อตรวจวินิจฉัยเพิ่มเติม
        </React.Fragment>
      ),
    },
  },
  bloodPressure: {
    low: {
      title: "ต่ำ",
      detail: (
        <React.Fragment>
          ความดันโลหิตต่ำกว่าปกติ ควรหยุดกิจกรรม
          <br />
          ทุกอย่างที่กำลังทำอยู่ ให้นั่งพักหรือนอนลง
          <br />
          ดื่มน้ำหรือน้ำเกลือแร่ หากอาการไม่ดีขึ้น
          <br />
          ควรรีบไปพบแพทย์
        </React.Fragment>
      ),
    },
    normal: {
      title: "ปกติ",
      detail: (
        <React.Fragment>
          ความดันโลหิตอยู่ในเกณฑ์ปกติ
          <br />
          ดูแลรักษาสุขภาพให้แข็งแรง
          <br />
          และหมั่นตรวจเช็คความดันโลหิต
          <br />
          อย่างสม่ำเสมอ
        </React.Fragment>
      ),
    },
    over: {
      title: "สูงเล็กน้อย",
      detail: (
        <React.Fragment>
          ความดันโลหิตเริ่มสูง ควรควบคุมอาหาร
          <br />
          ออกกำลังกาย และหมั่นตรวจเช็ค
          <br />
          ความดันโลหิตอย่างสม่ำเสมอ
        </React.Fragment>
      ),
    },
    high: {
      title: "สูง",
      detail: (
        <React.Fragment>
          ความดันโลหิตสูง ควรควบคุมน้ำหนักให้อยู่
          <br />
          ในเกณฑ์ที่เหมาะสม งดสูบบุหรี่ ออกกำลังกาย
          <br />
          สม่ำเสมอ ลดอาหารเค็ม และไปพบแพทย์
          <br />
          เพื่อตรวจวินิจฉัยเพิ่มเติม
        </React.Fragment>
      ),
    },
  },
  rate: {
    low: {
      title: "ช้ากว่าปกติ",
      detail: (
        <React.Fragment>
          ชีพจรเต้นช้ากว่าปกติ หากมีอาการหน้ามืด
          <br />
          เป็นลม เวียนศีรษะ อ่อนเพลีย หรือหมดสติ
          <br />
          ร่วมด้วย ควรไปพบแพทย์ทันที
        </React.Fragment>
      ),
    },
    normal: {
      title: "ปกติ",
      detail: (
        <React.Fragment>
          ชีพจรอยู่ในเกณฑ์ปกติ ดูแลรักษา
          <br />
          สุขภาพให้แข็งแรง ออกกำลังกาย
          <br />
          และหมั่นตรวจเช็คชีพจรอย่างสม่ำเสมอ
        </React.Fragment>
      ),
    },
    high: {
      title: "เร็วกว่าปกติ",
      detail: (
        <React.Fragment>
          ชีพจรเต้นเร็วกว่าปกติ คนที่ออกกำลังกาย
          <br />
          ใหม่ ๆ ตื่นเต้น โกรธ กลัว หรือตกใจ อาจทำให้
          <br />
          หัวใจเต้นเร็วได้ แต่หากหัวใจเต้นเร็ว
          <br />
          ตลอดเวลาแม้แต่ขณะหลับจะถือว่าผิดปกติ
        </React.Fragment>
      ),
    },
  },
  oxygen: {
    low: {
      title: "ต่ำ",
      detail: (
        <React.Fragment>
          ค่าความอิ่มตัวของออกซิเจนในเลือด
          <br />
          ต่ำกว่าปกติ อาจส่งผลให้สมองทำงานช้าลง
          <br />
          การเข้าไปอยู่ในสถานที่อับอากาศ
          <br />
          ก็เป็นสาเหตุให้เกิดสภาวะออกซิเจนต่ำได้
        </React.Fragment>
      ),
    },
    normal: {
      title: "ปกติ",
      detail: (
        <React.Fragment>
          ค่าความอิ่มตัวของออกซิเจนในเลือดอยู่ใน
          <br />
          เกณฑ์ปกติ เป็นสภาวะที่ดีที่สุดต่อร่างกาย
          <br />
          ส่งผลให้สมองทำงานดี มีผิวพรรณดี
          <br />
          และร่างกายแข็งแรง
        </React.Fragment>
      ),
    },
    high: {
      title: "สูง",
      detail: (
        <React.Fragment>
          ค่าความอิ่มตัวของออกซิเจนในเลือดสูงกว่า
          <br />
          ปกติ เกิดจากการที่ร่างกายได้รับออกซิเจน
          <br />
          มากเกินไป อาจเกิดอาการออกซิเจนเป็นพิษ
          <br />
          ทำให้ระบบทางเดินหายใจทำงานผิดปกติได้
        </React.Fragment>
      ),
    },
  },
};
